In [1]:
import pandas as pd
import numpy as np

### 1. Convert strings to datetime

**Default arguments**

In [2]:
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})

In [3]:
df

        date  value
0  3/10/2000      2
1  3/11/2000      3
2  3/12/2000      4

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      object
 1   value   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [5]:
df['date'] = pd.to_datetime(df['date'])

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      datetime64[ns]
 1   value   3 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 176.0 bytes

### Day first format

In [11]:
# here we are saying that the first block of the date is day, according to this it will format the date to right/ default format. (yyyy-mm-dd)

df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})
df['date'] = pd.to_datetime(df['date'], dayfirst=True)

In [12]:
df

        date  value
0 2000-10-03      2
1 2000-11-03      3
2 2000-12-03      4

### Custom format

Ref - https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html

In [15]:
df = pd.DataFrame({'date': ['2016-6-10 20:30:0', 
                            '2016-7-1 19:45:30', 
                            '2013-10-12 4:5:1'],
                   'value': [2, 3, 4]})

In [16]:
df

                date  value
0  2016-6-10 20:30:0      2
1  2016-7-1 19:45:30      3
2   2013-10-12 4:5:1      4

In [17]:
df['date'] = pd.to_datetime(df['date'], format="%Y-%d-%m %H:%M:%S")

In [18]:
df

                 date  value
0 2016-10-06 20:30:00      2
1 2016-01-07 19:45:30      3
2 2013-12-10 04:05:01      4

### Speedup parsing with infer_datetime_format

In [19]:
df = pd.DataFrame({'date': ['3/11/2000', '3/12/2000', '3/13/2000'] * 1000 })
df.head()

        date
0  3/11/2000
1  3/12/2000
2  3/13/2000
3  3/11/2000
4  3/12/2000

In [21]:
import time

start = time.time()
pd.to_datetime(df['date'], infer_datetime_format=False)
end = time.time()

print(end - start)

0.0019919872283935547

C:\Users\suhas j c\AppData\Local\Temp\ipykernel_6864\4158216847.py:4: UserWarning: The argument 'infer_datetime_format' is deprecated and will be removed in a future version. A strict version of it is now the default, see https://pandas.pydata.org/pdeps/0004-consistent-to-datetime-parsing.html. You can safely remove this argument.
  pd.to_datetime(df['date'], infer_datetime_format=False)

In [22]:
import time

start = time.time()
pd.to_datetime(df['date'], infer_datetime_format=True)
end = time.time()

print(end - start)

0.0030105113983154297

C:\Users\suhas j c\AppData\Local\Temp\ipykernel_6864\2124779971.py:4: UserWarning: The argument 'infer_datetime_format' is deprecated and will be removed in a future version. A strict version of it is now the default, see https://pandas.pydata.org/pdeps/0004-consistent-to-datetime-parsing.html. You can safely remove this argument.
  pd.to_datetime(df['date'], infer_datetime_format=True)

### Handle parsing error

In [23]:
df = pd.DataFrame({'date': ['3/10/2000', 'a/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})

In [24]:
df

        date  value
0  3/10/2000      2
1  a/11/2000      3
2  3/12/2000      4

In [25]:
df['date'] = pd.to_datetime(df['date'])

ValueError: time data "a/11/2000" doesn't match format "%m/%d/%Y", at position 1. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [28]:
df['date'] = pd.to_datetime(df['date'], errors='ignore')
df

        date  value
0  3/10/2000      2
1  a/11/2000      3
2  3/12/2000      4

In [30]:
df['date'] = pd.to_datetime(df['date'], errors='coerce') # it gives the NaT (Not a time) as answer for error values.
df

        date  value
0 2000-03-10      2
1        NaT      3
2 2000-03-12      4

 ### 2. Assemble a datetime from multiple columns

In [31]:
df = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})

In [32]:
df

   year  month  day
0  2015      2    4
1  2016      3    5

In [33]:
df['date'] = pd.to_datetime(df)

In [34]:
df

   year  month  day       date
0  2015      2    4 2015-02-04
1  2016      3    5 2016-03-05

### 3. Get year, month and day

In [35]:
df = pd.DataFrame({'name': ['Tom', 'Andy', 'Lucas'],
                 'DoB': ['08-05-1997', '04-28-1996', '12-16-1995']})

In [36]:
df

    name         DoB
0    Tom  08-05-1997
1   Andy  04-28-1996
2  Lucas  12-16-1995

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   DoB     3 non-null      object
dtypes: object(2)
memory usage: 176.0+ bytes

In [38]:
df['DoB'] = pd.to_datetime(df['DoB'])

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   DoB     3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 176.0+ bytes

In [40]:
df['DoB'].dt.year

0    1997
1    1996
2    1995
Name: DoB, dtype: int32

In [41]:
df['DoB'].dt.month

0     8
1     4
2    12
Name: DoB, dtype: int32

In [42]:
df['DoB'].dt.day

0     5
1    28
2    16
Name: DoB, dtype: int32

In [43]:
df['year']= df['DoB'].dt.year
df['month']= df['DoB'].dt.month
df['day']= df['DoB'].dt.day
df

    name        DoB  year  month  day
0    Tom 1997-08-05  1997      8    5
1   Andy 1996-04-28  1996      4   28
2  Lucas 1995-12-16  1995     12   16

### 4. Get the week of year, the day of week and leap year

In [44]:
df['DoB'].dt.week

AttributeError: 'DatetimeProperties' object has no attribute 'week'

In [48]:
df['DoB'].dt.isocalendar().week

0    32
1    17
2    50
Name: week, dtype: UInt32

In [46]:
 df['DoB'].dt.dayofweek # 0 - mon, 1 - tue, 2 - wed, 3 - thur, 4 - fri, 5 - sat, 6 - sunday

0    1
1    6
2    5
Name: DoB, dtype: int32

In [50]:
df['DoB'].dt.weekday

0    1
1    6
2    5
Name: DoB, dtype: int32

In [47]:
df['DoB'].dt.is_leap_year

0    False
1     True
2    False
Name: DoB, dtype: bool

In [49]:
df['week_of_year'] = df['DoB'].dt.isocalendar().week
df['day_of_week'] = df['DoB'].dt.dayofweek
df['is_leap_year'] = df['DoB'].dt.is_leap_year
df

    name        DoB  year  month  day  week_of_year  day_of_week  is_leap_year
0    Tom 1997-08-05  1997      8    5            32            1         False
1   Andy 1996-04-28  1996      4   28            17            6          True
2  Lucas 1995-12-16  1995     12   16            50            5         False

### MAP Function

It takes dict as an argument and maps the specified key in dataframe/ series

In [51]:
dw_mapping={
    0: 'Monday', 
    1: 'Tuesday', 
    2: 'Wednesday', 
    3: 'Thursday', 
    4: 'Friday',
    5: 'Saturday', 
    6: 'Sunday'
} 
df['day_of_week_name']=df['DoB'].dt.weekday.map(dw_mapping)
df

,name,DoB,year,month,day,week_of_year,day_of_week,is_leap_year,day_of_week_name
0,Tom,1997-08-05,1997,8,5,32,1,False,Tuesday
1,Andy,1996-04-28,1996,4,28,17,6,True,Sunday
2,Lucas,1995-12-16,1995,12,16,50,5,False,Saturday

### 5. Get the age from the date of birth

In [53]:
pd.to_datetime('today') # it gives the current day date and time.

Timestamp('2024-05-26 10:40:42.348205')

In [54]:
pd.to_datetime('today').year

2024

In [55]:
pd.to_datetime('today').day

26

In [56]:
pd.to_datetime('today').month

5

In [57]:
pd.to_datetime('today').hour

10

In [58]:
pd.to_datetime('today').minute

41

In [60]:
pd.to_datetime('today').second

35

In [63]:
pd.to_datetime('today').year - df['year']

0    27
1    28
2    29
Name: year, dtype: int32

In [65]:
df['age'] = pd.to_datetime('today').year - df['DoB'].dt.year
df

,name,DoB,year,month,day,week_of_year,day_of_week,is_leap_year,day_of_week_name,age
0,Tom,1997-08-05,1997,8,5,32,1,False,Tuesday,27
1,Andy,1996-04-28,1996,4,28,17,6,True,Sunday,28
2,Lucas,1995-12-16,1995,12,16,50,5,False,Saturday,29

In [68]:
# Year difference
today = pd.to_datetime('today')
diff_y = today.year - df['DoB'].dt.year


# Haven't had birthday
b_md = df['DoB'].apply(lambda x: (x.month,x.day) )
no_birthday = b_md > (today.month,today.day)

In [69]:
no_birthday

0     True
1    False
2     True
Name: DoB, dtype: bool

In [70]:
df['age'] = diff_y - no_birthday
df

,name,DoB,year,month,day,week_of_year,day_of_week,is_leap_year,day_of_week_name,age
0,Tom,1997-08-05,1997,8,5,32,1,False,Tuesday,26
1,Andy,1996-04-28,1996,4,28,17,6,True,Sunday,28
2,Lucas,1995-12-16,1995,12,16,50,5,False,Saturday,28

### 6. Improve performance by setting date column as the index

In [77]:
df = pd.read_csv('C:/Users/suhas j c/OneDrive/Desktop/suhas/data/city_sales.csv',parse_dates=['date']) # it will parse date column to datetime datatype
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 376433 entries, 0 to 376432
Data columns (total 3 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    376433 non-null  datetime64[ns]
 1   num     376433 non-null  int64
 2   city    376433 non-null  object
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 8.6+ MB

In [78]:
df

                      date  num    city
0      2015-01-01 09:00:00    4  London
1      2015-01-01 09:01:00    4  London
2      2015-01-01 09:02:00    3  London
3      2015-01-01 09:03:00    3  London
4      2015-01-01 09:04:00    3  London
...                    ...  ...     ...
376428 2018-06-06 09:54:00    3  London
376429 2018-06-06 09:55:00    3  London
376430 2018-06-06 09:56:00    3  London
376431 2018-06-06 09:57:00    3  London
376432 2018-06-06 09:58:00    1  London

[376433 rows x 3 columns]

In [79]:
df = df.set_index(['date'])

In [80]:
df

                     num    city
date
2015-01-01 09:00:00    4  London
2015-01-01 09:01:00    4  London
2015-01-01 09:02:00    3  London
2015-01-01 09:03:00    3  London
2015-01-01 09:04:00    3  London
...                  ...     ...
2018-06-06 09:54:00    3  London
2018-06-06 09:55:00    3  London
2018-06-06 09:56:00    3  London
2018-06-06 09:57:00    3  London
2018-06-06 09:58:00    1  London

[376433 rows x 2 columns]

### 7. Select data with a specific year and perform aggregation

In [81]:
df.loc['2018']

                     num    city
date
2018-01-01 09:00:00    2  London
2018-01-01 09:01:00    1  London
2018-01-01 09:02:00    3  London
2018-01-01 09:03:00    3  London
2018-01-01 09:04:00    3  London
...                  ...     ...
2018-06-06 09:54:00    3  London
2018-06-06 09:55:00    3  London
2018-06-06 09:56:00    3  London
2018-06-06 09:57:00    3  London
2018-06-06 09:58:00    1  London

[47211 rows x 2 columns]

In [82]:
df.loc['2018','num'].sum()

132127

In [83]:
df['2018'].groupby('city').sum()

KeyError: '2018'

In [84]:
df.loc['2018'].groupby('city').sum()

           num
city
London  132127

### 8. Select data with a specific month or a specific day of the month

In [85]:
df.loc['2018-5']

                     num    city
date
2018-05-01 09:00:00    1  London
2018-05-01 09:01:00    4  London
2018-05-01 09:02:00    3  London
2018-05-01 09:03:00    2  London
2018-05-01 09:04:00    3  London
...                  ...     ...
2018-05-31 15:56:00    3  London
2018-05-31 15:57:00    3  London
2018-05-31 15:58:00    4  London
2018-05-31 15:59:00    2  London
2018-05-31 16:00:00    3  London

[9683 rows x 2 columns]

In [86]:
df.loc['2018-5-1']

                     num    city
date
2018-05-01 09:00:00    1  London
2018-05-01 09:01:00    4  London
2018-05-01 09:02:00    3  London
2018-05-01 09:03:00    2  London
2018-05-01 09:04:00    3  London
...                  ...     ...
2018-05-01 15:56:00    2  London
2018-05-01 15:57:00    4  London
2018-05-01 15:58:00    1  London
2018-05-01 15:59:00    4  London
2018-05-01 16:00:00    1  London

[421 rows x 2 columns]

In [89]:
df.index

DatetimeIndex(['2015-01-01 09:00:00', '2015-01-01 09:01:00',
               '2015-01-01 09:02:00', '2015-01-01 09:03:00',
               '2015-01-01 09:04:00', '2015-01-01 09:05:00',
               '2015-01-01 09:06:00', '2015-01-01 09:07:00',
               '2015-01-01 09:08:00', '2015-01-01 09:09:00',
               ...
               '2018-06-06 09:49:00', '2018-06-06 09:50:00',
               '2018-06-06 09:51:00', '2018-06-06 09:52:00',
               '2018-06-06 09:53:00', '2018-06-06 09:54:00',
               '2018-06-06 09:55:00', '2018-06-06 09:56:00',
               '2018-06-06 09:57:00', '2018-06-06 09:58:00'],
              dtype='datetime64[ns]', name='date', length=376433, freq=None)

In [87]:
cond = df.index.month==3

In [88]:
cond

array([False, False, False, ..., False, False, False])

In [90]:
df[cond]

                     num    city
date
2015-03-02 09:00:00    1  London
2015-03-02 09:01:00    3  London
2015-03-02 09:02:00    2  London
2015-03-02 09:03:00    3  London
2015-03-02 09:04:00    1  London
...                  ...     ...
2018-03-30 15:56:00    4  London
2018-03-30 15:57:00    2  London
2018-03-30 15:58:00    3  London
2018-03-30 15:59:00    3  London
2018-03-30 16:00:00    3  London

[37890 rows x 2 columns]

### 9. Select data between two dates

In [91]:
df.loc['2016' : '2018']

                     num    city
date
2016-01-01 09:00:00    4  London
2016-01-01 09:01:00    3  London
2016-01-01 09:02:00    4  London
2016-01-01 09:03:00    4  London
2016-01-01 09:04:00    2  London
...                  ...     ...
2018-06-06 09:54:00    3  London
2018-06-06 09:55:00    3  London
2018-06-06 09:56:00    3  London
2018-06-06 09:57:00    3  London
2018-06-06 09:58:00    1  London

[266552 rows x 2 columns]

In [92]:
df.loc['2018-5-2 10' : '2018-5-2 11' ]

                     num    city
date
2018-05-02 10:00:00    2  London
2018-05-02 10:01:00    3  London
2018-05-02 10:02:00    4  London
2018-05-02 10:03:00    4  London
2018-05-02 10:04:00    4  London
...                  ...     ...
2018-05-02 11:55:00    4  London
2018-05-02 11:56:00    3  London
2018-05-02 11:57:00    4  London
2018-05-02 11:58:00    3  London
2018-05-02 11:59:00    4  London

[120 rows x 2 columns]

In [93]:
df.loc['2018-5-2 10:30' : '2018-5-2 10:45' ]

                     num    city
date
2018-05-02 10:30:00    3  London
2018-05-02 10:31:00    3  London
2018-05-02 10:32:00    1  London
2018-05-02 10:33:00    3  London
2018-05-02 10:34:00    3  London
2018-05-02 10:35:00    3  London
2018-05-02 10:36:00    3  London
2018-05-02 10:37:00    2  London
2018-05-02 10:38:00    3  London
2018-05-02 10:39:00    3  London
2018-05-02 10:40:00    2  London
2018-05-02 10:41:00    4  London
2018-05-02 10:42:00    3  London
2018-05-02 10:43:00    3  London
2018-05-02 10:44:00    3  London
2018-05-02 10:45:00    4  London

In [95]:
df.between_time('10:30','10:45')

                     num    city
date
2015-01-01 10:30:00    4  London
2015-01-01 10:31:00    3  London
2015-01-01 10:32:00    3  London
2015-01-01 10:33:00    3  London
2015-01-01 10:34:00    4  London
...                  ...     ...
2018-06-05 10:41:00    3  London
2018-06-05 10:42:00    3  London
2018-06-05 10:43:00    1  London
2018-06-05 10:44:00    2  London
2018-06-05 10:45:00    3  London

[14304 rows x 2 columns]